golang/logs/gin/test1.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        25 bytes

Concurrency Level:      100
Time taken for tests:   0.096 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      74000 bytes
HTML transferred:       12500 bytes
Requests per second:    5230.84 [#/sec] (mean)
Time per request:       19.117 [ms] (mean)
Time per request:       0.191 [ms] (mean, across all concurrent requests)
Transfer rate:          756.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   1.6      5      11
Processing:     3   12   9.4      8      40
Waiting:        0    9   9.2      5      37
Total:          7   18   9.7     13      44

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     16
  75%     17
  80%     30
  90%     36
  95%     38
  98%     42
  99%     43
 100%     44 (longest request)