golang/logs/gin/test2.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        25 bytes

Concurrency Level:      100
Time taken for tests:   1.359 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1480000 bytes
HTML transferred:       250000 bytes
Requests per second:    7358.63 [#/sec] (mean)
Time per request:       13.589 [ms] (mean)
Time per request:       0.136 [ms] (mean, across all concurrent requests)
Transfer rate:          1063.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5   1.3      5      11
Processing:     1    8   5.1      7      56
Waiting:        0    6   5.1      5      54
Total:          1   13   4.8     13      59

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     13
  75%     14
  80%     14
  90%     15
  95%     18
  98%     31
  99%     43
 100%     59 (longest request)