golang/logs/gin/test3.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            4000

Document Path:          /
Document Length:        25 bytes

Concurrency Level:      500
Time taken for tests:   12.523 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      14800000 bytes
HTML transferred:       2500000 bytes
Requests per second:    7985.54 [#/sec] (mean)
Time per request:       62.613 [ms] (mean)
Time per request:       0.125 [ms] (mean, across all concurrent requests)
Transfer rate:          1154.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   27   6.3     27      50
Processing:     0   35   9.7     34     170
Waiting:        0   26   9.1     24     158
Total:          0   62   9.4     62     198

Percentage of the requests served within a certain time (ms)
  50%     62
  66%     64
  75%     66
  80%     67
  90%     72
  95%     76
  98%     86
  99%     96
 100%    198 (longest request)